points = 0
print("Вітаємо у нашій грі-вікторині!\nЗа кожне правильне питання ви отримаєте +10 балів.\nМаксимальна кількість балів - 50.\n!Попередження: пишіть все з великої літери, без пробілів!")
while True:
    enter = input("Натисніть Enter, щоб почати гру")
    if enter == "":
        print("Гру розпочато!")
        break
    else:
        continue
#питання 1
ans1 = input("Питання 1: Яке прізвище першого президента України?")
if ans1 == "Кравчук":
    points += 10
    print("Правильна відповідь! :)\n  +10 балів")
else:
    print("Відповідь не правильна :(\n Правильна відповідь: Кравчук")
#питання2
ans2 = input("Питання 2: Яке справжнє прізвище Лесі Українки?")
if ans2 == "Косач":
    points += 10
    print("Правильна відповідь! :)\n  +10 балів")
else:
    print("Відповідь не правильна :(\n Правильна відповідь: Косач")
#питання 3
ans3 = input("Питання 3: Яка столиця України?")
if ans3 == "Київ":
    points += 10
    print("Правильна відповідь! :)\n  +10 балів")
else:
    print("Відповідь не правильна :(\n Правильна відповідь: Київ")
#питання 4
ans4 = input("Питання 4: Який рік заснування Київської Русі?")
if ans4 == "882":
    points += 10
    print("Правильна відповідь! :)\n  +10 балів")
else:
    print("Відповідь не правильна :(\n Правильна відповідь: 882")
#питання 5
ans5 = input("Питання 5: Якого року було проголошено незалежність України?")
if ans5 == "1991":
    points += 10
    print("Правильна відповідь! :)\n  +10 балів")
else:
    print("Відповідь не правильна :(\n Правильна відповідь: 1991")
#гру завершено
print(f"Гарна робота! Ви заробили {points} балів з 50 можливих")
like = input("Вам сподобалась гра? (Так/Ні)")
if like == "Так":
    print("Ура! Я рада :)")
elif like == "Ні":
    print("Йой, дуже шкода :(")
else:
    print("Не зрозуміло")